In [1]:
import pandas as pd 
import numpy as np
dt = pd.read_csv("Births2015.csv")
dt.head()

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
0,1,2015-01-01,8068,Thu,2015,1,1,1,5
1,2,2015-01-02,10850,Fri,2015,1,2,2,6
2,3,2015-01-03,8328,Sat,2015,1,3,3,7
3,4,2015-01-04,7065,Sun,2015,1,4,4,1
4,5,2015-01-05,11892,Mon,2015,1,5,5,2

In [2]:
dt.tail()
#dt.shape

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
360,361,2015-12-27,7518,Sun,2015,12,361,27,1
361,362,2015-12-28,13100,Mon,2015,12,362,28,2
362,363,2015-12-29,13458,Tue,2015,12,363,29,3
363,364,2015-12-30,13100,Wed,2015,12,364,30,4
364,365,2015-12-31,11608,Thu,2015,12,365,31,5

In [3]:
dt[10:15]

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
10,11,2015-01-11,7172,Sun,2015,1,11,11,1
11,12,2015-01-12,11479,Mon,2015,1,12,12,2
12,13,2015-01-13,11924,Tue,2015,1,13,13,3
13,14,2015-01-14,12013,Wed,2015,1,14,14,4
14,15,2015-01-15,12339,Thu,2015,1,15,15,5

In [4]:
dt1= dt.iloc[:,1:3]
dt1.head()

         date  births
0  2015-01-01    8068
1  2015-01-02   10850
2  2015-01-03    8328
3  2015-01-04    7065
4  2015-01-05   11892

In [5]:

dt.head()
dt['births'].unique
dt['births'].values
dt['births'].mean()
#dt.mean()

10899.991780821918

Create Series

In [6]:
import numpy as np
import pandas as pd 
S_First= pd.Series([4,11,21,26])
S_First

0     4
1    11
2    21
3    26
dtype: int64

In [7]:
type(S_First)

pandas.core.series.Series

In [8]:
S_First= pd.Series([4,11,21,26], index=[1,2,3,4])
S_First

1     4
2    11
3    21
4    26
dtype: int64

In [9]:
#Create Series with list
Series_from_list = pd.Series(list("abcdef"))
Series_from_list

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [10]:
type(Series_from_list)

pandas.core.series.Series

In [11]:
#Create Series from ndarray
np_country= np.array(["Bangladesh","India","Afghanistan","Thailand","Philipine","Singapure","Malaysia","Dubai"])
np_country

array(['Bangladesh', 'India', 'Afghanistan', 'Thailand', 'Philipine',
       'Singapure', 'Malaysia', 'Dubai'], dtype='<U11')

In [12]:
country_Series= pd.Series(np_country)
country_Series

0     Bangladesh
1          India
2    Afghanistan
3       Thailand
4      Philipine
5      Singapure
6       Malaysia
7          Dubai
dtype: object

In [13]:
##Create Series from Dict

dict_country_GDP = pd.Series(["59,939","8,612","38,214","44,680","1,980","6,579","56,746","10,118","2,982","1,564"],
                        index=["USA", "China","Japan","Germany","India","Thailand","Singapore","Malaysia","Philippines","Bangladesh"])

In [14]:
dict_country_GDP

USA            59,939
China           8,612
Japan          38,214
Germany        44,680
India           1,980
Thailand        6,579
Singapore      56,746
Malaysia       10,118
Philippines     2,982
Bangladesh      1,564
dtype: object

In [15]:
#Create Serice from scalar 
scalar_Series = pd.Series(5.,index=["a","b","c","d"])
scalar_Series

a    5.0
b    5.0
c    5.0
d    5.0
dtype: float64

Access data elements in Series

In [16]:
#access element in the series using idexing
dict_country_GDP[0]

'59,939'

In [49]:
#access 5 element from from the series using indexing operators
dict_country_GDP[1:3]

China     8,612
Japan    38,214
dtype: object

In [51]:
#lookup a country by name (access the element of series using .loc[] function.)
dict_country_GDP.loc['USA']

'59,939'

In [19]:
#lookup by position(access the element of series using .iloc[] function.)
dict_country_GDP.iloc[0]

'59,939'

Vectorized or Binary Operation in Series

In [20]:
#Vectorized operations are performed by the data elements position:
first_vector_series= pd.Series([1,2,3,4],index=["a","b","c","d"])
second_vector_series= pd.Series([10,20,30,40], index=["a","b","c","d"])

In [21]:
first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [22]:
second_vector_series= pd.Series([10,20,30,40], index=["a","d","b","c"])

In [23]:
first_vector_series + second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [24]:
#now replace few indexes with new ones  in second vector series
second_vector_series= pd.Series([10,20,30,40], index=["a","d","e","f"])

In [53]:
sum_of_2vector=first_vector_series + second_vector_series
sum_of_2vector

a    11.0
b     NaN
c     NaN
d    24.0
e     NaN
f     NaN
dtype: float64

In [56]:
#Count()function we use to count non NaN values
sum_of_2vector.count()

2

Conversion Operation on Series

In [76]:
#dt.head()
print(type(dt["births"]))
birth_list = dt["births"].to_list()
print(type(birth_list))

<class 'pandas.core.series.Series'>
<class 'list'>

Create a DataFrame

DataFrame is a two-dimensinal labeled data structure with columns of potentially different data type
Data Type: Integer, String, Python Object, Floating point
Data Inputs: ndarray, dict, list, Series, DataFrame

Create a DataFrame from list

In [26]:
#Create a DataFrame from a dict of equal lengthh of list
olympic_data_list ={"HostContry":["Japan","Sydney","Beijing","London","Atlantic","Athens"],
                    "Year":[2020,2016,2012,2008,2004,2000],
                    "No. of Participating Country":[210,208,204,201,200,197]
                    }

In [27]:
olympic_data = pd.DataFrame(olympic_data_list)
olympic_data

  HostContry  Year  No. of Participating Country
0      Japan  2020                           210
1     Sydney  2016                           208
2    Beijing  2012                           204
3     London  2008                           201
4   Atlantic  2004                           200
5     Athens  2000                           197

In [28]:
#Creating a DataFrame from a dict
olympic_data_dict = {"Japan":{2020:210},"London":{2012:208},"Beijing":{2008:204}}

In [29]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)
df_olympic_data_dict

      Japan  London  Beijing
2020  210.0     NaN      NaN
2012    NaN   208.0      NaN
2008    NaN     NaN    204.0

In [30]:
#View DataFrame
#Select by  Cityname
olympic_data.HostContry

0       Japan
1      Sydney
2     Beijing
3      London
4    Atlantic
5      Athens
Name: HostContry, dtype: object

In [31]:
#use describe function to display the content
olympic_data.describe

<bound method NDFrame.describe of   HostContry  Year  No. of Participating Country
0      Japan  2020                           210
1     Sydney  2016                           208
2    Beijing  2012                           204
3     London  2008                           201
4   Atlantic  2004                           200
5     Athens  2000                           197>

In [32]:
#Create DataFrame from dict of Series
olympic_participation = pd.Series([205,204,201,200,197], index=[2012, 2008, 2004, 2000,1996])
olympic_country = pd.Series(["London","Beijing","Sydney","Athens","Atlantic"], index=[2012,2008,2004,2000,1996])

In [33]:
df_olympic_data = pd.DataFrame({"No. of Participating country":olympic_participation, "HostCountry":olympic_country})
df_olympic_data

      No. of Participating country HostCountry
2012                           205      London
2008                           204     Beijing
2004                           201      Sydney
2000                           200      Athens
1996                           197    Atlantic

In [34]:
#Create DataFrame from ndarray
ndarr_DataFrame = np.array([2,3,4,5,6,7,8,9])
dt_ndarr_DataFrame = pd.DataFrame(ndarr_DataFrame)
dt_ndarr_DataFrame

   0
0  2
1  3
2  4
3  5
4  6
5  7
6  8
7  9

In [35]:
Country=np.array(["Bangladesh","India","Afghanistan","Thailand","Philipine","Singapure","Malaysia","Dubai"])
GDP = np.array([1250,1150,560,2580,3500,6500,2300,3500])

In [36]:
dt_country_GDP = pd.DataFrame({"Country":Country, "GDP":GDP})
dt_country_GDP

       Country   GDP
0   Bangladesh  1250
1        India  1150
2  Afghanistan   560
3     Thailand  2580
4    Philipine  3500
5    Singapure  6500
6     Malaysia  2300
7        Dubai  3500

In [37]:
#Create a DataFrame from DataFrame
import numpy as np
import pandas as pd

dt_from_df = pd.DataFrame(df_olympic_data)
dt_from_df

      No. of Participating country HostCountry
2012                           205      London
2008                           204     Beijing
2004                           201      Sydney
2000                           200      Athens
1996                           197    Atlantic

Handling Missing Data

In [38]:
import pandas as pd

In [39]:
#Declear first series
first_Serice = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
first_Serice

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [40]:
second_series = pd.Series([6,7,8,9,10],index=['c','e','f','h','a'])
second_series

c     6
e     7
f     8
h     9
a    10
dtype: int64

In [41]:
sum_of_series = first_Serice+second_series
sum_of_series

a    11.0
b     NaN
c     9.0
d     NaN
e    12.0
f     NaN
h     NaN
dtype: float64

In [42]:
#Drop NaN(Not a Number) values from datasets
#We use dropna() function to drop NaN value from datasets
dropna_s=sum_of_series.dropna()
dropna_s

a    11.0
c     9.0
e    12.0
dtype: float64

In [43]:
#Fill NaN(not a number) values with zeros
fillna_s=sum_of_series.fillna(0)
fillna_s

a    11.0
b     0.0
c     9.0
d     0.0
e    12.0
f     0.0
h     0.0
dtype: float64

In [44]:
#fill values with zeroes before performing addition operation for missing indices

fill_NaN_withZero_before_sum=first_Serice.add(second_series,fill_value=0)
fill_NaN_withZero_before_sum

a    11.0
b     2.0
c     9.0
d     4.0
e    12.0
f     8.0
h     9.0
dtype: float64

Data Operation

Data Operation can be performed through various built-in methods for faster  data processing

In [45]:
#Declear movie rating dataframe: rating from 1 to 5(star* rating)

data_movies_rating = pd.DataFrame({
    "movies1":[5,4,3,2,2,1],
    "movies2":[4,5,2,3,4,2],
}, index=["Tom","Jerry","Jeff","Petter","Ram","Ted"]
)

In [46]:
data_movies_rating

        movies1  movies2
Tom           5        4
Jerry         4        5
Jeff          3        2
Petter        2        3
Ram           2        4
Ted           1        2

While performing data operation, custom functions can be applied with the applymapjmethod

In [47]:
def movie_grade(rating):
    if rating == 5:
        return "A"
    if rating == 4:
        return "B"
    if rating == 3:
        return "C" 
    else:
        return "F" 

movie_grade(2)

'F'

In [48]:
#Use applymap function 
data_movies_rating.applymap(movie_grade)

       movies1 movies2
Tom          A       B
Jerry        B       A
Jeff         C       F
Petter       F       C
Ram          F       B
Ted          F       F

Data Operation with statistical function

In [2]:
import pandas as pd 
import numpy as np
df_test_score = pd.DataFrame({"Test1": [95, 84, 73, 88, 82, 61],
                              "Test2": [74, 85, 83, 73, 77, 79]},
                             index=["Jack", "Lewis", "Patrick", "Rich", "Kelly","Paula"]

                             )

In [4]:
df_test_score.max()

Test1    95
Test2    85
dtype: int64

In [7]:
df_test_score.mean(), df_test_score.min(), df_test_score.std()

(Test1    80.5
 Test2    78.5
 dtype: float64,
 Test1    61
 Test2    73
 dtype: int64,
 Test1    11.979149
 Test2     4.806246
 dtype: float64)

Data Operation using Groupby

In [8]:
df_president_name = pd.DataFrame({"first":["George","Bill","Ronald","Barak","Jimmy","George"],
                                    "last":["Bush","Clinton","Regan","Obama","Carter","Washington"]})

In [9]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Barak       Obama
4   Jimmy      Carter
5  George  Washington

In [10]:
grouped=df_president_name.groupby('first')
grouped

In [11]:
grd_data = grouped.get_group("George")
grd_data

    first        last
0  George        Bush
5  George  Washington

In [12]:
#operation by sort

df_president_name.sort_values("first")

    first        last
3   Barak       Obama
1    Bill     Clinton
0  George        Bush
5  George  Washington
4   Jimmy      Carter
2  Ronald       Regan

In [13]:
df_president_name.sort_values("last")

    first        last
0  George        Bush
4   Jimmy      Carter
1    Bill     Clinton
3   Barak       Obama
2  Ronald       Regan
5  George  Washington

In [14]:
df_president_name.sort_index()

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Barak       Obama
4   Jimmy      Carter
5  George  Washington

Data Standardization

In [15]:
#Standardization of dataset
def standardize_test(test):
    return (test-test.mean())/test.std()

In [17]:
standardize_test(df_test_score["Test1"])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [18]:
def standardize_test_score(datafra):
    return datafra.apply(standardize_test)

In [19]:
standardize_test_score(df_test_score )

            Test1     Test2
Jack     1.210437 -0.936282
Lewis    0.292174  1.352407
Patrick -0.626088  0.936282
Rich     0.626088 -1.144344
Kelly    0.125218 -0.312094
Paula   -1.627829  0.104031

In [5]:
import pandas as pd
df_student_math = pd.DataFrame({"student":["Tom","Jim","Jerry","Tofi","Jemi","David"],
                                "ID":[10,56,32,45,55,65]})

In [6]:
df_student_science = pd.DataFrame({"student":["Tom","Ram","David"],
                                    "ID":[10,22,65]})

In [7]:
#Marge df_student_math and df_student_science dataset
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  65

In [12]:
#Merge with keyon student
pd.merge(df_student_math,df_student_science,on="student")

  student  ID_x  ID_y
0     Tom    10    10
1   David    65    65

In [13]:
#merge with left join
pd.merge(df_student_math,df_student_science, on="ID", how="left").fillna("X")

  student_x  ID student_y
0       Tom  10       Tom
1       Jim  56         X
2     Jerry  32         X
3      Tofi  45         X
4      Jemi  55         X
5     David  65     David

In [14]:
#merge with right join with fillna X
pd.merge(df_student_math,df_student_science, on="ID", how="right").fillna("X")

  student_x  ID student_y
0       Tom  10       Tom
1         X  22       Ram
2     David  65     David

In [17]:
#concatenate datafames
pd.concat([df_student_math,df_student_science], ignore_index=True)

  student  ID
0     Tom  10
1     Jim  56
2   Jerry  32
3    Tofi  45
4    Jemi  55
5   David  65
6     Tom  10
7     Ram  22
8   David  65

In [18]:
#create new dataset with duplicate value
df_student_survey_data = pd.DataFrame({"student":["Tom","Jim","David","Tom","Jemi","David"],
                                "ID":[10,56,65,10,55,65]})

In [19]:
#view the dataframe

df_student_survey_data

  student  ID
0     Tom  10
1     Jim  56
2   David  65
3     Tom  10
4    Jemi  55
5   David  65

In [20]:
#check for duplicate values
df_student_survey_data.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [21]:
#drop duplicated values with student as key
df_student_survey_data.drop_duplicates("student")

  student  ID
0     Tom  10
1     Jim  56
2   David  65
4    Jemi  55

In [22]:
#drop duplicated values with ID as key
df_student_survey_data.drop_duplicates("ID")

  student  ID
0     Tom  10
1     Jim  56
2   David  65
4    Jemi  55

Pandas SQL Operation

In [23]:
import pandas as pd
import sqlite3

In [24]:
#create sql table
create_table ="""
CREATE TABLE  student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science Real
)"""

In [25]:
#Execute the sql statement
executeSQL = sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit()

In [26]:
#Prepare a SQL query
SQL_query = executeSQL.execute("select * from student_score")

In [28]:
#fecth result from SQLLITE database
resultset = SQL_query.fetchall()
resultset

[]

In [32]:
#prepare record to be insert into sql table through the sql statement

insertSQL = [(10,"Jack",85,93),(29,"Tom", 78,98),(45,"Devid",87,65),(56,"Jefi",78,89)]

In [35]:
#insert record into seq table through sql statement
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [37]:
SQL_query = executeSQL.execute("select * from student_score")
resultset = SQL_query.fetchall()
resultset

[(10, 'Jack', 85.0, 93.0),
 (29, 'Tom', 78.0, 98.0),
 (45, 'Devid', 87.0, 65.0),
 (56, 'Jefi', 78.0, 89.0)]

In [40]:
df=pd.read_csv("faa_ai_prelim.csv")
df.shape

(83, 42)

In [ ]:
#View the first five observation
df.head()

In [47]:
#view all the columns present in the dataset
df.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

In [49]:
#Now create a new dataframe with required column
df_analyse =df[['ACFT_MAKE_NAME','LOC_STATE_NAME','ACFT_MODEL_NAME','RMK_TEXT','FLT_PHASE', 
                'EVENT_TYPE_DESC','FATAL_FLAG']]

In [51]:
#view the type of data object
type(df_analyse)

pandas.core.frame.DataFrame

In [ ]:
#view fist five observation
df_analyse.head()

In [54]:
# replace the NAN value for Fatal Flag with no 
df_analyse["FATAL_FLAG"].fillna(value="no", inplace=True)

C:\Python3.10\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [56]:
df_analyse.head()
df_analyse.shape

(83, 7)